#+TITLE: Plan for Lab Data Service Dashboard
#+AUTHOR: VLEAD
#+DATE: [2017-06-19 Mon]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document briefly explains plan for =lab-data-service-dashboard= project.


* Milestones Snapshot
  |---+----+----+-----+-------------+------+--------+-----+-----+--------|
  |   | S. | Mi | Req | Milestone   | Plan | Status | Est | Act | Issues |
  |   | no | no | Map |             |      |        | hrs | hrs |        |
  |---+----+----+-----+-------------+------+--------+-----+-----+--------|
  |   |  1 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/1][1]]  |     | [[https://github.com/vlead/lab-data-service-dashboard/milestone/1][Milestone 1]] | [[tbl-mil-1][ref]]  | Closed |   2 |   1 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/1?closed=1][ref]]    |
  |---+----+----+-----+-------------+------+--------+-----+-----+--------|
  |   |  2 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/2][2]]  |     | [[https://github.com/vlead/lab-data-service-dashboard/milestone/2][Milestone 2]] | [[tbl-mil-2][ref]]  | Closed |   0 |   0 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/2?closed=1][ref]]    |
  |---+----+----+-----+-------------+------+--------+-----+-----+--------|
  |   |  3 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/5][5]]  |     | [[https://github.com/vlead/lab-data-service-dashboard/milestone/5][Refactor]]    | [[ref]]  | Open   |  29 |   0 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/5?closed=1][ref]]    |
  |---+----+----+-----+-------------+------+--------+-----+-----+--------|
  |   |    |    |     | Total       |      |        |  31 |   1 |        |
  | ^ |    |    |     |             |      |        | est | act |        |
  |---+----+----+-----+-------------+------+--------+-----+-----+--------|
  #+TBLFM: $2=@#-2
  #+TBLFM: @3$8=remote(tbl-mil-1, $est)
  #+TBLFM: @3$9=remote(tbl-mil-1, $act)
  #+TBLFM: @4$8=remote(tbl-mil-2, $est)
  #+TBLFM: @4$9=remote(tbl-mil-2, $act)
  #+TBLFM: @5$8=remote(tbl-mil-5, $est)
  #+TBLFM: @5$9=remote(tbl-mil-5, $act)
  #+TBLFM: $est=vsum(@II+1..@-1)
  #+TBLFM: $act=vsum(@II+1..@-1)


* Detailed Plans 
** [[https://github.com/vlead/lab-data-service-dashboard/milestone/1][Milestone 1]]
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone1
  :END: 
  This milestone captures the requirements, design and
  implementation for login and logout pages with
  implementation and deployment.
#+caption:  realization-plan-ml-1
#+name: tbl-mil-1
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   | S.NO | Tasks                   | Github | Expected | Actual  | Status | Assignee |
|   |      |                         | Issues | Effort   | Effort  |        |          |
|   |      |                         |        | (person  | (person |        |          |
|   |      |                         |        | hours)   | hours)  |        |          |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |   1. | Requirements            | [[https://github.com/vlead/lab-data-service-dashboard/issues/1][#1]]     | 2        | 1       | Done   | Madhavi  |
|   |      | Gathering               |        |          |         |        | Puliraju |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |   2. | Implement Log in        | [[https://github.com/vlead/lab-data-service-dashboard/issues/2][#2]]     |          |         | Done   | Utkarsh  |
|   |      | and logout feature      |        |          |         |        |          |
|   |      | with Google             |        |          |         |        |          |
|   |      | authentication          |        |          |         |        |          |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |   3. | Implement API's         | [[https://github.com/vlead/lab-data-service-dashboard/issues/3][#3]],    |          |         | Done   | Yahnit   |
|   |      | for log in and log out, |        |          |         |        |          |
|   |      | users and roles         |        |          |         |        |          |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |   4. | Implement the           | [[https://github.com/vlead/lab-data-service-dashboard/issues/4][#4]]     |          |         | Done   | Yahnit   |
|   |      | unit test cases         |        |          |         |        |          |
|   |      | for log in, log out,    |        |          |         |        |          |
|   |      | users and roles         |        |          |         |        |          |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |   5. | Integration of          | [[https://github.com/vlead/lab-data-service-dashboard/issues/5][#5]]     |          |         | Done   | Utkarsh  |
|   |      | google authentication   |        |          |         |        |          |
|   |      | with log in and logout  |        |          |         |        |          |
|   |      | API's                   |        |          |         |        |          |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |   6. | Data Model for Lab      | [[https://github.com/vlead/lab-data-service-dashboard/issues/6][#6]]     |          |         | Done   | Madhavi  |
|   |      | Data Service Dashboard  |        |          |         |        | Puliraju |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |   7. | Documention to run      | [[https://github.com/vlead/lab-data-service-dashboard/issues/7][#7]]     |          |         | Done   | Madhavi  |
|   |      | the lds dashboard in    |        |          |         |        | Puliraju |
|   |      | development environment |        |          |         |        |          |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |   8. | Auto Deployment         | [[https://github.com/vlead/lab-data-service-dashboard/issues/11][#11]]    |          |         | Done   | Madhavi  |
|   |      | of LDS Dashboard        |        |          |         |        | Puliraju |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |   9. | first level Model       | [[https://github.com/vlead/lab-data-service-dashboard/issues/12][#12]]    |          |         | Done   | Madhavi  |
|   |      | Review for milestone1   |        |          |         |        | Puliraju |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |  10. | First Review            | [[https://github.com/vlead/lab-data-service-dashboard/issues/13][#13]]    |          |         | Done   | Madhavi  |
|   |      | Comments [09-06-2017]   |        |          |         |        | Puliraju |
|---+------+-------------------------+--------+----------+---------+--------+----------|
|   |      | Total                   |        | 2        | 1       |        |          |
| ^ |      |                         |        | est      | act     |        |          |
|---+------+-------------------------+--------+----------+---------+--------+----------|
 #+TBLFM: $est=vsum(@II+1..@-1)
 #+TBLFM: $act=vsum(@II+1..@-1)



  *Note* : Expected and Actual Efforts are calculated in person hours. 


** [[https://github.com/vlead/lab-data-service/milestone/2][Milestone 2]]
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone2
  :END: 
  Implementation of Front End with Login, Logout, Admin and
  Guest Dashboards as Single Page Applications (SPA). This
  Implementation does not use any framework. Implementation
  will be done using pure java script.
#+caption:  realization-plan-ml-2
#+name: tbl-mil-2
|------+------------------------+--------+----------+---------+-------------+----------+---|
| S.NO | Tasks                  | Github | Expected | Actual  | Status      | Assignee |   |
|      |                        | Issues | Effort   | Effort  |             |          |   |
|      |                        |        | (person  | (person |             |          |   |
|      |                        |        | hours)   | hours)  |             |          |   |
|------+------------------------+--------+----------+---------+-------------+----------+---|
|   1. | Implementation         | [[https://github.com/vlead/lab-data-service-dashboard/issues/9][#9]]     |          |         | In Progress | Yahnit,  |   |
|      | of Admin Dashboard     |        |          |         |             | Utkarsh  |   |
|------+------------------------+--------+----------+---------+-------------+----------+---|
|   2. | Implementation         | [[https://github.com/vlead/lab-data-service-dashboard/issues/10][#10]]    |          |         | In Progress | Yahnit,  |   |
|      | of 'Guest' Dashboard   |        |          |         |             | Utkarsh  |   |
|------+------------------------+--------+----------+---------+-------------+----------+---|
|   3. | Re-Implementation      | [[https://github.com/vlead/lab-data-service-dashboard/issues/14][#14]]    |          |         | In Progress | Utkarsh  |   |
|      | of Log in and Log out  |        |          |         |             |          |   |
|      | using Single Page      |        |          |         |             |          |   |
|      | Application (SPA)      |        |          |         |             |          |   |
|------+------------------------+--------+----------+---------+-------------+----------+---|
|   4. | Read Json elements     | [[https://github.com/vlead/lab-data-service-dashboard/issues/15][#15]]    |          |         | Done        | Yahnit   |   |
|      | and generate html code |        |          |         |             |          |   |
|------+------------------------+--------+----------+---------+-------------+----------+---|
|   5. | Implement Event        | [[https://github.com/vlead/lab-data-service-dashboard/issues/16][#16]]    |          |         | In Progress | Yahnit   |   |
|      | handlers for all       |        |          |         |             |          |   |
|      | CRUD operations        |        |          |         |             |          |   |
|      | in front end           |        |          |         |             |          |   |
|------+------------------------+--------+----------+---------+-------------+----------+---|
|      |                        | Total  | 0        | 0       |             |          |   |
|    ^ |                        |        | est      | act     |             |          |   |
|------+------------------------+--------+----------+---------+-------------+----------+---|
 #+TBLFM: $est=vsum(@II+1..@-1)
 #+TBLFM: $act=vsum(@II+1..@-1)

  *Note*: Expected and Actual Efforts are calculated in person hours. 


** [[https://github.com/vlead/lab-data-service-dashboard/milestone/5][Refactor]]
 #+caption:  realization-plan-ml-5
 #+name: tbl-mil-5
 |---+----+------------------+--------+----------+--------+-----------+--------+--------+----------|
 |   | S. | Tasks            | Github | Expected | Actual | Estimated | Actual | Status | Assignee |
 |   | NO |                  | Issues | Effort   | Effort | Start,    | Start/ |        |          |
 |   |    |                  |        | (in      | (in    | End       | End    |        |          |
 |   |    |                  |        | person   | person | Dates     | Dates  |        |          |
 |   |    |                  |        | hours)   | hours) |           |        |        |          |
 |---+----+------------------+--------+----------+--------+-----------+--------+--------+----------|
 |   | 1. | Provide all      | [[https://github.com/vlead/lab-data-service-dashboard/issues/37][#37]]    | 15       |        |           |        |        |          |
 |   |    | screens for      |        |          |        |           |        |        |          |
 |   |    | one single role  |        |          |        |           |        |        |          |
 |---+----+------------------+--------+----------+--------+-----------+--------+--------+----------|
 |   | 2. | Run in user      | [[https://github.com/vlead/lab-data-service-dashboard/issues/38][#38]]    | 6        |        |           |        |        |          |
 |   |    | development      |        |          |        |           |        |        |          |
 |   |    | environment      |        |          |        |           |        |        |          |
 |---+----+------------------+--------+----------+--------+-----------+--------+--------+----------|
 |   | 3. | Deploy using ADS | [[https://github.com/vlead/lab-data-service-dashboard/issues/39][#39]]    | 8        |        |           |        |        |          |
 |---+----+------------------+--------+----------+--------+-----------+--------+--------+----------|
 |   |    | Total            |        | 29       | 0      |           |        |        |          |
 | ^ |    |                  |        | est      | act    |           |        |        |          |
 |---+----+------------------+--------+----------+--------+-----------+--------+--------+----------|
 #+TBLFM: $est=vsum(@II+1..@-1)
 #+TBLFM: $act=vsum(@II+1..@-1)
   


* Realization 
    :PROPERTIES:
    :CUSTOM_ID: cc_realization
    :END:    

  Implementing the above plan will result into the
  following -
   + Admin will be able to do all =CRUD= operations on labs
     data through Admin portal in LDS dashboard.
   + Admin Role should be able to perform all the =CRUD=
     operations through LDS dashboard.
   + Admin Role should be able to add other users and assign
     roles to them in Admin portal in LDS dashboard.
   + Guest Role should be able to =Read/View= the labs data
     through guest portal in LDS dashboard.
   + Authentication and Authorization should be provided for
     all the LDS Dashboard users.
   + LDS Dashboard will be able to Generate HTML code from
     the given JSON specification.


 
  
